package com.neuedu.task.$2024_07_19;

public class Task02 {
    public static void main(String[] args) {
        /*
            四级项目4
            题目2：有一地下组织的接头密文为：{“锤完”，“另一只”，“谁也”，"大雁"，“他在”，“一只”,“天上”，“追呀追”,“飞呀飞”，“锤呀锤”，“后面”,"追上"，“以后”，“一顿”，“不认识谁”}.
            另有一本解密书籍，其中提示密文会按照以下顺序排列{5,3,4,6,8,1,3,4,6,7,11,12,13,9,0,12,2,14}.
            要求解出接头暗语 并最后输出。
        */
        // 密文
        String[] strings = {"锤完", "另一只", "谁也", "大雁", "他在", "一只", "天上", "追呀追，", "飞呀飞，", "锤呀锤，", "后面", "追上", "以后", "一顿", "不认识谁"};
        // 密钥
        int[] key = {5, 3, 4, 6, 8, 1, 3, 4, 6, 7, 11, 12, 13, 9, 0, 12, 2, 14};
        for (int i = 0; i < key.length; i++) {
            System.out.print(strings[key[i]] );  // 结果： 一只大雁他在天上飞呀飞，另一只大雁他在天上追呀追，追上以后一顿锤呀锤，锤完以后谁也不认识谁
        }
    }
}
